Repository: kelvinkosbab/KozBon
Catalog: KozBonPackages/BonjourLocalization/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, ja, zh_hans

# a11y_ai_backend_picker_hint
source: Choose between on-device Apple Intelligence and your own Anthropic Claude account.
ar: اختر بين Apple Intelligence على الجهاز وحساب Anthropic Claude الخاص بك.
de: Wählen Sie zwischen Apple Intelligence auf dem Gerät und Ihrem eigenen Anthropic-Claude-Konto.
es: Elige entre Apple Intelligence en el dispositivo y tu propia cuenta de Anthropic Claude.
fr: Choisissez entre Apple Intelligence sur l'appareil et votre propre compte Anthropic Claude.
he: בחר בין Apple Intelligence במכשיר לבין חשבון Anthropic Claude האישי שלך.
ja: デバイス上の Apple Intelligence と、ご自身の Anthropic Claude アカウントから選択します。
zh_hans: 在设备端 Apple Intelligence 与您自己的 Anthropic Claude 账户之间选择。

# a11y_ai_cloud_sign_in_hint
source: Stores your Anthropic API key in the device Keychain. KozBon never sees it.
ar: يحفظ مفتاح Anthropic API الخاص بك في سلسلة مفاتيح الجهاز. لن يراه KozBon أبدًا.
de: Speichert Ihren Anthropic-API-Schlüssel im Schlüsselbund des Geräts. KozBon sieht ihn nie.
es: Guarda tu clave de API de Anthropic en el Llavero del dispositivo. KozBon nunca la ve.
fr: Stocke votre clé d'API Anthropic dans le trousseau de l'appareil. KozBon ne la voit jamais.
he: שומר את מפתח ה‑API של Anthropic שלך במחזיק המפתחות של המכשיר. KozBon לעולם לא רואה אותו.
ja: Anthropic の API キーをデバイスのキーチェーンに保存します。KozBon が確認することはありません。
zh_hans: 将您的 Anthropic API 密钥保存到设备钥匙串中。KozBon 不会看到密钥。

# a11y_ai_cloud_sign_out_hint
source: Removes your Anthropic API key from the device Keychain.
ar: يحذف مفتاح Anthropic API الخاص بك من سلسلة مفاتيح الجهاز.
de: Entfernt Ihren Anthropic-API-Schlüssel aus dem Schlüsselbund des Geräts.
es: Elimina tu clave de API de Anthropic del Llavero del dispositivo.
fr: Supprime votre clé d'API Anthropic du trousseau de l'appareil.
he: מסיר את מפתח ה‑API של Anthropic שלך ממחזיק המפתחות של המכשיר.
ja: Anthropic の API キーをデバイスのキーチェーンから削除します。
zh_hans: 从设备钥匙串中移除您的 Anthropic API 密钥。

# settings_ai_backend_section_purpose
source: Powers the long-press Insights explanations of discovered services and the Chat tab's conversational assistant.
ar: يشغّل شروحات Insights عند الضغط مطوّلاً على الخدمات المكتشفة ومساعد المحادثة في علامة تبويب Chat.
de: Treibt die Insights-Erklärungen beim Längerdrücken auf entdeckte Dienste und den dialogorientierten Assistenten im Chat-Tab an.
es: Activa las explicaciones de Insights al mantener pulsado un servicio descubierto y el asistente conversacional de la pestaña Chat.
fr: Alimente les explications d'Insights lors d'un appui long sur les services découverts et l'assistant conversationnel de l'onglet Chat.
he: מפעיל את הסברי Insights בלחיצה ארוכה על שירותים שהתגלו ואת עוזר השיחה בכרטיסיית Chat.
ja: 発見したサービスを長押ししたときの Insights による説明と、Chat タブの対話アシスタントを支えます。
zh_hans: 为长按已发现服务时的 Insights 说明以及聊天标签中的对话助手提供支持。

# settings_ai_backend_apple_privacy
source: Apple Intelligence runs entirely on this device — no data leaves your device.
ar: يعمل Apple Intelligence بالكامل على هذا الجهاز — لا تغادر أي بيانات جهازك.
de: Apple Intelligence läuft vollständig auf diesem Gerät — keine Daten verlassen Ihr Gerät.
es: Apple Intelligence se ejecuta completamente en este dispositivo: ningún dato sale del dispositivo.
fr: Apple Intelligence s'exécute entièrement sur cet appareil — aucune donnée ne quitte votre appareil.
he: Apple Intelligence פועל כולו במכשיר זה — שום נתונים לא יוצאים מהמכשיר שלך.
ja: Apple Intelligence は完全にこのデバイス上で動作します — データはデバイスから出ません。
zh_hans: Apple Intelligence 完全在本设备上运行 —— 数据不会离开您的设备。

# a11y_ai_cloud_sign_in_learn_more_hint
source: Opens Anthropic's API key page in your browser.
ar: يفتح صفحة مفاتيح Anthropic API في متصفّحك.
de: Öffnet die API-Schlüsselseite von Anthropic in Ihrem Browser.
es: Abre la página de claves de API de Anthropic en tu navegador.
fr: Ouvre la page des clés d'API d'Anthropic dans votre navigateur.
he: פותח את עמוד מפתחות ה‑API של Anthropic בדפדפן שלך.
ja: Anthropic の API キーページをブラウザで開きます。
zh_hans: 在浏览器中打开 Anthropic 的 API 密钥页面。

# chat_scanning_network
source: Scanning network…
ar: جارٍ فحص الشبكة…
de: Netzwerk wird durchsucht…
es: Buscando en la red…
fr: Analyse du réseau…
he: סורק את הרשת…
ja: ネットワークをスキャン中…
zh_hans: 正在扫描网络…

# chat_sign_in_to_claude_title
source: Sign in to Claude
ar: تسجيل الدخول إلى Claude
de: Bei Claude anmelden
es: Iniciar sesión en Claude
fr: Se connecter à Claude
he: התחברות ל‑Claude
ja: Claude にサインイン
zh_hans: 登录 Claude

# chat_sign_in_to_claude_body
source: You've selected Anthropic Claude as your assistant. Sign in with your Anthropic API key to start chatting.
ar: لقد اخترت Anthropic Claude مساعدًا لك. سجّل الدخول باستخدام مفتاح Anthropic API الخاص بك لبدء المحادثة.
de: Sie haben Anthropic Claude als Ihren Assistenten ausgewählt. Melden Sie sich mit Ihrem Anthropic-API-Schlüssel an, um zu chatten.
es: Has seleccionado Anthropic Claude como tu asistente. Inicia sesión con tu clave de API de Anthropic para empezar a chatear.
fr: Vous avez sélectionné Anthropic Claude comme assistant. Connectez-vous avec votre clé d'API Anthropic pour commencer à discuter.
he: בחרת ב‑Anthropic Claude כעוזר שלך. התחבר באמצעות מפתח ה‑API של Anthropic כדי להתחיל לשוחח.
ja: アシスタントとして Anthropic Claude を選択しています。Anthropic の API キーでサインインしてチャットを開始してください。
zh_hans: 您已选择 Anthropic Claude 作为助手。请使用您的 Anthropic API 密钥登录以开始聊天。

# settings_ai_backend_github_subtitle
source: OpenAI GPT-4o via GitHub Models.
ar: ‏OpenAI GPT-4o عبر GitHub Models.
de: OpenAI GPT-4o über GitHub Models.
es: OpenAI GPT-4o a través de GitHub Models.
he: ‏OpenAI GPT-4o דרך GitHub Models.
ja: GitHub Models 経由の OpenAI GPT-4o。
zh_hans: 通过 GitHub Models 使用 OpenAI GPT-4o。

# settings_ai_backend_github_privacy
source: Cloud — requests sent to GitHub's API. Subject to GitHub's terms.
ar: سحابي — تُرسل الطلبات إلى واجهة GitHub البرمجية. يخضع لشروط GitHub.
de: Cloud — Anfragen werden an die GitHub‑API gesendet. Es gelten die Bedingungen von GitHub.
es: Nube: las solicitudes se envían a la API de GitHub. Sujeto a los términos de GitHub.
fr: Cloud — les requêtes sont envoyées à l’API de GitHub. Soumis aux conditions de GitHub.
he: ענן — בקשות נשלחות ל‑API של GitHub. כפוף לתנאי GitHub.
ja: クラウド — リクエストは GitHub の API に送信されます。GitHub の利用規約に従います。
zh_hans: 云端 — 请求将发送到 GitHub 的 API，受 GitHub 条款约束。

# settings_ai_cloud_sign_in_github
source: Sign in to GitHub
ar: تسجيل الدخول إلى GitHub
de: Bei GitHub anmelden
es: Iniciar sesión en GitHub
fr: Se connecter à GitHub
he: התחברות ל‑GitHub
ja: GitHub にサインイン
zh_hans: 登录 GitHub

# aicloud_sign_in_title_github
source: Sign in to GitHub Models
ar: تسجيل الدخول إلى GitHub Models
de: Bei GitHub Models anmelden
es: Iniciar sesión en GitHub Models
fr: Se connecter à GitHub Models
he: התחברות ל‑GitHub Models
ja: GitHub Models にサインイン
zh_hans: 登录 GitHub Models

# aicloud_sign_in_body_github
source: Paste a GitHub Personal Access Token to use GPT-4o for chat and Insights.
ar: ألصق رمز وصول شخصي من GitHub لاستخدام GPT-4o في المحادثة و Insights.
de: Füge ein persönliches GitHub‑Zugriffstoken ein, um GPT-4o im Chat und in den Insights zu nutzen.
es: Pega un token de acceso personal de GitHub para usar GPT-4o en el chat y los Insights.
fr: Collez un jeton d’accès personnel GitHub pour utiliser GPT-4o dans le chat et les Insights.
he: הדבק אסימון גישה אישי של GitHub כדי להשתמש ב‑GPT-4o לצ’אט ול‑Insights.
ja: GitHub の Personal Access Token を貼り付けて、チャットと Insights で GPT-4o を使用します。
zh_hans: 粘贴 GitHub 个人访问令牌以在聊天和 Insights 中使用 GPT-4o。

# aicloud_sign_in_get_key_github
source: Get a personal access token
ar: احصل على رمز وصول شخصي
de: Persönliches Zugriffstoken erstellen
es: Obtener un token de acceso personal
fr: Obtenir un jeton d’accès personnel
he: קבל אסימון גישה אישי
ja: Personal Access Token を取得
zh_hans: 获取个人访问令牌

# aicloud_sign_in_validation_hint_github
source: Tokens start with 'ghp_' or 'github_pat_'
ar: تبدأ الرموز بـ ‘ghp_’ أو ‘github_pat_’
de: Tokens beginnen mit „ghp_“ oder „github_pat_“
es: Los tokens empiezan por 'ghp_' o 'github_pat_'
fr: Les jetons commencent par « ghp_ » ou « github_pat_ »
he: אסימונים מתחילים ב‑‘ghp_’ או ‘github_pat_’
ja: トークンは「ghp_」または「github_pat_」で始まります
zh_hans: 令牌以“ghp_”或“github_pat_”开头

# chat_sign_in_to_github_title
source: Sign in to GitHub
ar: تسجيل الدخول إلى GitHub
de: Bei GitHub anmelden
es: Iniciar sesión en GitHub
fr: Se connecter à GitHub
he: התחברות ל‑GitHub
ja: GitHub にサインイン
zh_hans: 登录 GitHub

# chat_sign_in_to_github_body
source: GitHub is selected but no token is configured. Sign in to start chatting with GPT-4o.
ar: تم اختيار GitHub لكن لم يتم إعداد أي رمز. سجّل الدخول لبدء المحادثة مع GPT-4o.
de: GitHub ist ausgewählt, aber es ist kein Token konfiguriert. Melde dich an, um mit GPT-4o zu chatten.
es: Has seleccionado GitHub, pero no hay ningún token configurado. Inicia sesión para empezar a chatear con GPT-4o.
fr: GitHub est sélectionné, mais aucun jeton n’est configuré. Connectez-vous pour discuter avec GPT-4o.
he: ‏GitHub נבחר, אך לא הוגדר אסימון. התחבר כדי להתחיל לשוחח עם GPT-4o.
ja: GitHub が選択されていますが、トークンが設定されていません。サインインして GPT-4o とのチャットを開始してください。
zh_hans: 已选择 GitHub，但尚未配置令牌。请登录以与 GPT-4o 开始聊天。

# insights_explain_with_github
source: Explain with GPT-4o
ar: اشرح باستخدام GPT-4o
de: Mit GPT-4o erklären
es: Explicar con GPT-4o
fr: Expliquer avec GPT-4o
he: הסבר באמצעות GPT-4o
ja: GPT-4o で説明
zh_hans: 用 GPT-4o 解释

# a11y_chat_error_open_github_pat_hint
source: Opens GitHub's personal-access-token settings in your browser.
ar: يفتح إعدادات رموز الوصول الشخصية في GitHub داخل المتصفح.
de: Öffnet die Einstellungen für persönliche Zugriffstoken von GitHub in deinem Browser.
es: Abre la configuración de tokens de acceso personal de GitHub en tu navegador.
fr: Ouvre les paramètres de jetons d’accès personnels de GitHub dans votre navigateur.
he: פותח את הגדרות אסימוני הגישה האישיים של GitHub בדפדפן.
ja: GitHub の Personal Access Token 設定をブラウザで開きます。
zh_hans: 在浏览器中打开 GitHub 的个人访问令牌设置页面。

# aicloud_sign_in_field_label_github
source: GitHub PAT
es: PAT de GitHub
fr: Jeton GitHub
